d1 = {'Кевин Спейси':[61,"США",179,"-","Лев",101],
              'Дэниел Рэдклифф':[31,"Великобритания",165,"-","Лев",110],
              'Аль Пачино':[80,"США",168,"-","Телец",120],
              'Крис Хэмсворт':[37,"Австралия",190,"В браке","Лев",130],
              'Райан Рейнольдс':[44,"Канада",188,"В браке","Весы",150],
              'Бен Аффлек':[48,"США",192,"В браке","Лев",151],
              'Роуэн Аткинсон':[66,"Великобритания",181,"-","Козерог",155],
              'Джонни Депп':[57,"США",178,"-","Близнецы",156],
              'Саша Барон Коэн':[49,"Великобритания",191,"В браке","Весы",160],
              'Энтони Хопкинс':[83,"Великобритания",175,"В браке","Козерог",163],
              'Джим Керри':[59,"Канада",188,"-","Козерог",180],
              'Эштон Кутчер':[43,"США",189,"В браке","Водолей",200],
              'Кевин Харт':[41,"США",163,"В браке","Рак",201],
              'Роберт Редфорд':[84,"США",179,"В браке","Лев",204],
              'Майк Майерс':[57,"Канада",173,"В браке","Близнецы",205],
              'Вин Дизель':[53,"США",183,"-","Рак",225],
              'Брюс Уиллис':[65,"Германия",183,"В браке","Рыбы",250],
              'Морган Фримен':[84,"США",188,"-","Близнецы",254],
              'Салман Кхан':[55,"Индия",173,"-","Козерог",255],
              'Жерар Депардье':[72,"Франция",180,"-","Козерог",255],
              'Джон Траволта':[66,"США",188,"В браке","Водолей",256],
              'Самюэль Л. Джексон':[72,"США",189,"В браке","Стрелец",257],
              'Бред Питт':[57,"США",180,"-","Стрелец",300],
              'Роберт де Ниро':[77,"США",175,"В браке","Лев",302],
              'Харрисон Форд':[78,"США",185,"В браке","Рак",305],
              'Эдвард Нортон':[51,"США",183,"В браке","Лев",306],
              'Марк Уолберг':[49,"США",173,"В браке","Близнецы",307],
              'Роберт Дауни - младший':[55,"США",174,"-","Овен",310],
              'Леонардо Ди Каприо':[46,"США",183,"-","Cкорпион",350],
              'Уилл Смит':[52,"США",188,"В браке","Весы",355],
              'Майкл Дуглас':[76,"США",178,"В браке","Весы",360],
              'Киану Ривз':[56,"Ливан",186,"-","Дева",361],
              'Клинт Иствуд':[90,"США",193,"В браке","Близнецы",375],
              'Джеки Чан':[68,"Гонконг",174,"В браке","Овен",395],
              'Том Хэнкс':[66,"США",183,"В браке","Рак",400],
              'Арнольд Шварценеггер':[75,"Австрия",185,"-","Лев",401],
              'Дуэйн Джонсон':[50,"США",196,"-","Телец",405],
              'Сильвестр Сталлоне':[76,"США",177,"В браке","Рак",406],
              'Билл Косби':[85,"США",183,"В браке","Рак",408],
              'Ларри Дэвид':[75,"США",180,"-","Рак",410],
              'Джек Николсон':[85,"США",177,"-","Телец",411],
              'Адам Сэндлер':[56,"США",177,"В браке","Дева",420],
              'Амитабх Биччан':[80,"Индия",188,"В браке","Весы",425],
              'Мел Гибсон':[66,"США",177,"-","Козерог",426],
              'Джордж Клуни':[61,"США",180,"В браке","Телец",600],
              'Том Круз':[60,"США",170,"-","Рак",610],
              'Шахрукх Хан':[57,"Индия",169,"В браке","Cкорпион",615],
              'Тайлер Перри':[53,"США",196,"-","Дева",800],
              'Шон Комбс (Пафф Дедди)':[53,"США",178,"-","Cкорпион",885],
              'Джерри Сайнфелд':[68,"США",180,"В браке","Телец",'1000']}
print("Вас приветствует чат-бот для проверки вашей совместимости с самыми богатыми мужчинами голливуда\nОтветьте, пожалуйста, на несколько вопросов")
status = input('Введите семейное положение вашего избранника в формате "В браке" или "-"\n')
d2 = {key: value for key, value in d1.items() if status in value}
while True:
    country = input('Откуда родом ваш мужчина?\n')
    d3 = {key: value for key, value in d2.items() if country in value}
    if len(d3) == 0:
        print("К сожалению в данной стране не родился ни один из самых богатых мужчин голливуда\nВыберите другую страну, пожалуйста")
    else:
        break
while True:
    money = int(input('Какое минимальное состояние должен иметь мужчина-актер?\nВведите значение от 101 до 1000 млн $\n'))
    d4 = {key: value for key, value in d3.items() if money<int(value[5])}
    if len(d4)==0:
        print("К сожалению, актеров с таким состоянием в данной стране нет, выберите сумму меньше, пожалуйста")
    else:
        break
while True:
    zodiac = input('Представителем какого знака зодиака является ваш избранник?\n')
    d5 = {key: value for key, value in d4.items() if zodiac in value}
    if len(d5)==0:
        print("К сожалению, актеров с таким знаком зодиака нет, выберите другой знак, пожалуйста")
    else:
        break
while True:
    min_age = int(input('Введите минимально-допустимый возраст вашего избранника\n'))
    max_age = int(input('Введите максимально-допустимый возраст вашего избранника\n'))
    d6 = {key: value for key, value in d5.items() if min_age<=int(value[0])<=max_age}
    if len(d6) == 0:
        print("К сожалению актеров с такими возрастными параметрами не найдено\nВыберите пожалуйста другой диапазон\n")
    else:
        break
while True:
    min_height = int(input('Введите минимально-допустимый рост вашего избранника\n'))
    max_height = int(input('Введите максимально-допустимый рост вашего избранника\n'))
    d7 = {key: value for key, value in d5.items() if min_height<=int(value[2])<=max_height}
    if len(d7) == 0:
        print("К сожалению актеров с такими параметрами роста не найдено\nВыберите пожалуйста другой диапазон\n")
    else:
        break
print("Наш чат-бот подобрал по вашим пожеланиям следующих избранников\nФормат вывода: возраст, место рождения, рост, семейное положение, знак зодиака, состояние")
print(d7)
input()
